* Ruby Notes
 * Ruby Quirks
	 ** define method
 * Ruby Tricks
	 #+NAME: Define Method
	 #+BEGIN_SRC ruby -n -r
    def name
      "Pankaj"
    end
    name
	 #+END_SRC
	 
  #+RESULTS: Define
	 =Pankaj
		=	 
 * Rake Tasks
	 * Argument in a rake task
     #+BEGIN_SRC ruby
      Consider a rake task : 
      task :test, [:arguments] => [:setup] do
        ['spec', 'support'].each{ |dir| $: << dir }
       Dir['spec/*_spec.rb'].each {|file| require File.basename(file , '.rb') }
      end

     task :setup , :arguments  do |taskname , params|
       ENV["VERBOSE"]="true" if params[:arguments] == "verbose"
     end
		 
		 #+END_SRC
		 [[Explanation][BEGIN]]
		 What is happening above is a rake task called test depends upon another task called setup
		 and we are passing the :arguments as first parameter to test task upon invocation which in turn
	   is passed to setup task in a hash with key as :arguments inside the block you get two parameters
     first is the task name which is set up in this case and other is the arguments hash.
		 
		 In order to invole above task : rake test[verbose] , we call the test task and pass verbose param.
		 [[Explanation][END]]

